test/artillery.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: 
  phases:
    - duration: 5
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    metrics-by-endpoint: {

    }
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 150
        - http.response_time.p95: 125
  processor: "./extensions.js"
scenarios:
  - flow:
      - loop:
        - post:
            url: "/"
            beforeRequest:
              - "setJSONBody"
        count: 100